levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_efm.c
/**
 *******************************************************************************
 * @file  hc32m423_efm.c
 * @brief This file provides firmware functions to manage the Embedded Flash
 *        Management unit (EFM).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-06       Heqb          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_efm.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_EFM EFM
 * @brief Embedded Flash Management Driver Library
 * @{
 */

#if (DDL_EFM_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EFM_Local_Macros EFM Local Macros
 * @{
 */

/**
 * @defgroup EFM_Configuration_Bit_Mask EFM Configuration Bit Mask
 * @{
 */
#define EFM_CHCHE_MASK             (EFM_FRMC_CRST | EFM_FRMC_ICHE | EFM_FRMC_DCHE)
#define EFM_CLR_FLAG_MASK          (EFM_CLR_FLAG_PEWERRCLR | EFM_CLR_FLAG_PEPRTERRCLR | \
                                    EFM_CLR_FLAG_OPTENDCLR | EFM_CLR_FLAG_COLERRCLR   | \
                                    EFM_CLR_FLAG_PGMISMTCHCLR)

/**
 * @}
 */
/**
 * @dexfgroup EFM_Check_Parameters_Validity EFM Check Parameters Validity
 * @{
 */
/*  Parameter validity check for pointer. */
#define IS_VALID_POINTER(x)                     (NULL != (x))

/*  Parameter validity check for flash latency. */
#define IS_VALID_EFM_WAIT_CYCLE(x)                                            \
(   ((x) == EFM_WAIT_CYCLE_0)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_1)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_2)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_3)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_4)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_5)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_6)              ||                                 \
    ((x) == EFM_WAIT_CYCLE_7))

/*  Parameter validity check for operate mode. */
#define IS_VALID_EFM_OPERATE_MD(x)                                            \
(   ((x) == EFM_MODE_PROGRAMSINGLE)        ||                                 \
    ((x) == EFM_MODE_PROGRAMREADBACK)      ||                                 \
    ((x) == EFM_MODE_PROGRAMSEQUENCE)      ||                                 \
    ((x) == EFM_MODE_ERASESECTOR)          ||                                 \
    ((x) == EFM_MODE_ERASECHIP)            ||                                 \
    ((x) == EFM_MODE_READONLY)             ||                                 \
    ((x) == EFM_MODE_READONLY1)            ||                                 \
    ((x) == EFM_MODE_READONLY2))

/*  Parameter validity check for flash interrupt select. */
#define IS_VALID_EFM_INT_SEL(x)                                               \
(   ((x) == EFM_INT_EOP)                   ||                                 \
    ((x) == EFM_INT_PEERR)                 ||                                 \
    ((x) == EFM_INT_RDCOLERR)              ||                                 \
    ((x) == EFM_INT_PEERR_OPTEND)          ||                                 \
    ((x) == EFM_INT_PEERR_RDCOLERR)        ||                                 \
    ((x) == EFM_INT_OPTEND_RDCOLERR)       ||                                 \
    ((x) == EFM_INT_ALL))

