levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_efm.c
/*  Parameter validity check for flash flag. */
#define IS_VALID_EFM_FLAG(x)                                                  \
(   ((x) == EFM_FLAG_PEWERR)               ||                                 \
    ((x) == EFM_FLAG_PEPRTERR)             ||                                 \
    ((x) == EFM_FLAG_PGMISMTCHERR)         ||                                 \
    ((x) == EFM_FLAG_OPTEND)               ||                                 \
    ((x) == EFM_FLAG_COLERR)               ||                                 \
    ((x) == EFM_FLAG_RDY))

/*  Parameter validity check for flash clear flag. */
#define IS_VALID_EFM_CLRFLAG(x)                                               \
(   ((x) == EFM_CLR_FLAG_PEWERRCLR)        ||                                 \
    ((x) == EFM_CLR_FLAG_PEPRTERRCLR)      ||                                 \
    ((x) == EFM_CLR_FLAG_PGMISMTCHCLR)     ||                                 \
    ((x) == EFM_CLR_FLAG_OPTENDCLR)        ||                                 \
    ((x) == EFM_CLR_FLAG_COLERRCLR)        ||                                 \
    ((x) == EFM_CLR_FLAG_MASK))

/*  Parameter validity check for bus state while flash program or erase. */
#define IS_VALID_EFM_BUS_STATUS(x)                                            \
(   ((x) == EFM_BUS_BUSY)                  ||                                 \
    ((x) == EFM_BUS_RELEASE))

/*  Parameter validity check for efm data cache reset function. */
#define IS_VALID_EFM_CACHERST_FUNC(x)                                         \
(   ((x) == EFM_CACHERST_ON)               ||                                 \
    ((x) == EFM_CACHERST_OFF))

/*  Parameter validity check for efm instruction cache function. */
#define IS_VALID_EFM_INSCACHE_FUNC(x)                                         \
(   ((x) == EFM_INSCACHE_ON)               ||                                 \
    ((x) == EFM_INSCACHE_OFF))

/*  Parameter validity check for efm data cache function. */
#define IS_VALID_EFM_DATACACHE_FUNC(x)                                        \
(   ((x) == EFM_DATACACHE_ON)              ||                                 \
    ((x) == EFM_DATACACHE_OFF))

/*  Parameter validity check for efm status . */
#define IS_VALID_EFM_STATUS(x)                                                \
(   ((x) == EFM_ON)                        ||                                 \
    ((x) == EFM_OFF))
/*  Parameter validity check for efm address. */
#define IS_VALID_EFM_ADDR(x)                             ((x) <= EFM_END_ADDR)


/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EFM_Global_Functions EFM Global Functions
 * @{
 */

/**
 * @brief  EFM unlock.
 * @param  None
 * @retval None
 */
void EFM_Unlock(void)
{
    M4_EFM->FAPRT = EFM_KEY1;
    M4_EFM->FAPRT = EFM_KEY2;
}
/**
 * @brief  EFM Lock.
 * @param  None
 * @retval None
 */
void EFM_Lock(void)
{
    M4_EFM->FAPRT = 0x00001111U;
}

/**
 * @brief  Enable or disable EFM.
 * @param  [in] u32efmstatus       Specifies the flash status.
 *  This parameter can be one of the following values:
 *   @arg  EFM_ON                  EFM Enable
 *   @arg  EFM_OFF                 EFM Disable
 * @retval None
 */
void EFM_Cmd(uint32_t u32efmstatus)
{
    DDL_ASSERT(IS_VALID_EFM_STATUS(u32efmstatus));
    M4_EFM->FSTP = u32efmstatus;
}

/**
 * @brief  Init efm config structure with default value.
 * @param  [in] pstcEfmCfg         The pointer of efm config structure.
 *   @arg u32WaitCycle             Specifies the efm latency.
 *   @arg u32InsCache              Specifies the instruction cache on or off.
 *   @arg u32DataCache             Specifies the data cache on or off.
 *   @arg u32BusStatus             Specifies the bus status busy or release while program & erase.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_StrucInit(stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcEfmCfg->u32WaitCycle = EFM_WAIT_CYCLE_0;
        pstcEfmCfg->u32CacheRst  = EFM_CACHERST_OFF;
        pstcEfmCfg->u32InsCache  = EFM_INSCACHE_OFF;
        pstcEfmCfg->u32DataCache = EFM_DATACACHE_OFF;
        pstcEfmCfg->u32BusStatus = EFM_BUS_BUSY;
    }

    return enRet;
}

/**
 * @brief  Efm Config.
 * @param  [in] pstcEfmCfg         The pointer of efm config structure.
 *   @arg u32WaitCycle             Specifies the efm latency.
 *   @arg u32CacheRst              Specifies the data cache reset on or off.
 *   @arg u32InsCache              Specifies the instruction cache on or off.
 *   @arg u32DataChche             Specifies the data cache on or off.
 *   @arg u32BusStatus             Specifies the bus status busy or release while program & erase.
 * @retval An en_result_t enumeration value:
 *           - Ok: Configure success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t EFM_Init(const stc_efm_cfg_t *pstcEfmCfg)
{
    en_result_t enRet = Ok;
    /* Check if pointer is NULL */
    if (NULL == pstcEfmCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Param valid check */
        DDL_ASSERT(IS_VALID_EFM_WAIT_CYCLE(pstcEfmCfg->u32WaitCycle));
        DDL_ASSERT(IS_VALID_EFM_BUS_STATUS(pstcEfmCfg->u32BusStatus));
        DDL_ASSERT(IS_VALID_EFM_CACHERST_FUNC(pstcEfmCfg->u32CacheRst));
        DDL_ASSERT(IS_VALID_EFM_INSCACHE_FUNC(pstcEfmCfg->u32InsCache));
        DDL_ASSERT(IS_VALID_EFM_DATACACHE_FUNC(pstcEfmCfg->u32DataCache));

        /* Config efm. */
        MODIFY_REG32(M4_EFM->FRMC, EFM_FRMC_FLWT | EFM_FRMC_ICHE | EFM_FRMC_DCHE | EFM_FRMC_CRST,
                     pstcEfmCfg->u32WaitCycle | pstcEfmCfg->u32DataCache |
                     pstcEfmCfg->u32InsCache | pstcEfmCfg->u32CacheRst);
        MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_BUSHLDCTL, pstcEfmCfg->u32BusStatus);
    }

    return enRet;
}

/**
 * @brief  Set the efm read wait cycles.
 * @param  [in] u32WaitCycle            Specifies the efm read wait cycles.
 *  This parameter can be one of the following values:
 *   @arg  EFM_WAIT_CYCLE_0             Don't insert read wait cycle
 *   @arg  EFM_WAIT_CYCLE_1             Insert 1 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_2             Insert 2 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_3             Insert 3 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_4             Insert 4 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_5             Insert 5 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_6             Insert 6 read wait cycles
 *   @arg  EFM_WAIT_CYCLE_7             Insert 7 read wait cycles
 * @retval None
 */
void EFM_SetWaitCycle(uint32_t u32WaitCycle)
{
    /* Param valid check */
    DDL_ASSERT(IS_VALID_EFM_WAIT_CYCLE(u32WaitCycle));
    /* Set the code latency value. */
    MODIFY_REG32(M4_EFM->FRMC, EFM_FRMC_FLWT, u32WaitCycle);
}

/**
 * @brief  Enable or disable the flash data cache reset.
 * @param  [in] enNewState                The new state of the flash data cache reset.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_DataCacheRstCmd(en_functional_state_t enNewState)
{
    if(Enable == enNewState)
    {
        SET_REG32_BIT(M4_EFM->FRMC, EFM_FRMC_CRST);
    }
    else
    {
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_FRMC_CRST);
    }
}

/**
 * @brief  Enable or disable the flash instruction cache.
 * @param  [in] enNewState                The new state of the flash instruction cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_InsCacheCmd(en_functional_state_t enNewState)
{
    if(Enable == enNewState)
    {
        SET_REG32_BIT(M4_EFM->FRMC, EFM_FRMC_ICHE);
    }
    else
    {
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_FRMC_ICHE);
    }
}

/**
 * @brief  Enable or disable the flash data cache.
 * @param  [in] enNewState                The new state of the flash data cache.
 *   @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_DataCacheCmd(en_functional_state_t enNewState)
{
    if(Enable == enNewState)
    {
        SET_REG32_BIT(M4_EFM->FRMC, EFM_FRMC_DCHE);
    }
    else
    {
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_FRMC_DCHE);
    }
}

/**
 * @brief  Set the FLASH erase program mode .
 * @param  [in] u32PgmMode                  Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_MODE_PROGRAMSINGLE           Program single at a specified address
 *   @arg  EFM_MODE_PROGRAMREADBACK         Program and read back at a specified address
 *   @arg  EFM_MODE_PROGRAMSEQUENCE         Program sequence at sequence address
 *   @arg  EFM_MODE_ERASESECTOR             Sector erase
 *   @arg  EFM_MODE_ERASECHIP               Chip erase
 *   @arg  EFM_MODE_READONLY                Read only
 *   @arg  EFM_MODE_READONLY1               Read only
 *   @arg  EFM_MODE_READONLY2               Read only
 * @retval None
 */
void EFM_SetOperateMode(uint32_t u32PgmMode)
{
    DDL_ASSERT(IS_VALID_EFM_OPERATE_MD(u32PgmMode));

    /* Enable operate mode modified. */
    SET_REG32_BIT(M4_EFM->FWMC, EFM_FWMC_PEMODE);
    /* Set the program or erase mode. */
    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_PEMOD, u32PgmMode);
    /* Disable operate mode modified. */
    CLEAR_REG32_BIT(M4_EFM->FWMC, EFM_FWMC_PEMODE);
}

/**
 * @brief  Enable or Disable EFM interrupt.
 * @param  [in] u32EfmInt               Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_INT_EOP                  End of EFM Operation Interrupt source
 *   @arg  EFM_INT_PEERR                Program/erase error Interrupt source
 *   @arg  EFM_INT_RDCOLERR             Read collide error Interrupt source
 *   @arg  EFM_INT_PEERR_OPTEND         Program/erase error and End of EFM operation
 *   @arg  EFM_INT_PEERR_RDCOLERR       Program/erase error and Read collide error
 *   @arg  EFM_INT_OPTEND_RDCOLERR      End of EFM operation and Read collide error
 *   @arg  EFM_INT_ALL                  All Interrupt source
 * @param  [in] enNewState              The new state of specified interrupt.
 *  This parameter can be: Enable or Disable.
 * @retval None
 */
void EFM_InterruptCmd(uint32_t u32EfmInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_VALID_EFM_INT_SEL(u32EfmInt));

