levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_efm.c
    if(Enable == enNewState)
    {
        SET_REG32_BIT(M4_EFM->FITE, u32EfmInt);
    }
    else
    {
        CLEAR_REG32_BIT(M4_EFM->FITE, u32EfmInt);
    }
}

/**
 * @brief  Checks whether the specified FLASH flag is set or not.
 * @param  [in] u32flag                  Specifies the FLASH flag to check.
 *  This parameter can be one of the following values:
 *   @arg  EFM_FLAG_PEWERR               Flash wirte protect error flag.
 *   @arg  EFM_FLAG_PEPRTERR             Flash program protect area error flag.
 *   @arg  EFM_FLAG_PGMISMTCHERR         Flash program miss match flag.
 *   @arg  EFM_FLAG_OPTEND               Flash end of program flag.
 *   @arg  EFM_FLAG_COLERR               Flash read write error flag.
 *   @arg  EFM_FLAG_RDY                  Flash ready flag.
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Interrupt flag is set
 *           - Reset: Interrupt flag is reset
 */
en_flag_status_t EFM_GetFlagStatus(uint32_t u32flag)
{
    DDL_ASSERT(IS_VALID_EFM_FLAG(u32flag));
    return ((0UL == (M4_EFM->FSR & u32flag)) ? Reset :Set);
}

/**
 * @brief  Clear the flash flag.
 * @param  [in] u32Flag                  Specifies the FLASH flag to clear.
 *  This parameter can be one of the following values:
 *   @arg  EFM_FLAG_CLR_PEWERRCLR        Flash wirte protect error flag.
 *   @arg  EFM_FLAG_CLR_PEPRTERRCLR      Flash program protect area error flag.
 *   @arg  EFM_FLAG_CLR_PGMISMTCHCLR     Flash program miss match flag.
 *   @arg  EFM_FLAG_CLR_OPTENDCLR        Flash end of program flag.
 *   @arg  EFM_FLAG_CLR_COLERRCLR        Flash read write error flag.
 * @retval None
 */
void EFM_ClearFlag(uint32_t u32Flag)
{
    DDL_ASSERT(IS_VALID_EFM_CLRFLAG(u32Flag));
    SET_REG32_BIT(M4_EFM->FSCLR, u32Flag);
}

/**
 * @brief  Set flash protect area.
 * @param  [in] u32StartAddr                  Start address of protect area.
 * @param  [in] u32EndAddr                    End address of protect area.
 * @retval None
 */
void EFM_SetWinProtectAddr(uint32_t u32StartAddr, uint32_t u32EndAddr)
{
    DDL_ASSERT(IS_VALID_EFM_ADDR(u32StartAddr));
    DDL_ASSERT(IS_VALID_EFM_ADDR(u32EndAddr));
    /* Set protect area start address */
    MODIFY_REG32(M4_EFM->FPMTSW, EFM_FPMTSW_FPMTSW, u32StartAddr);
    /* Set protect area end address */
    MODIFY_REG32(M4_EFM->FPMTEW, EFM_FPMTEW_FPMTEW, u32EndAddr);
}

/**
 * @brief  Set bus state while flash program or erase.
 * @param  [in] u32Status                 Specifies the new bus status while flash program or erase.
 *  This parameter can be one of the following values:
 *   @arg  EFM_BUS_BUSY                   Bus busy while flash program or erase.
 *   @arg  EFM_BUS_RELEASE                Bus releas while flash program or erase.
 * @retval None
 */
void EFM_SetBusStatus(uint32_t u32Status)
{
    DDL_ASSERT(IS_VALID_EFM_BUS_STATUS(u32Status));

    MODIFY_REG32(M4_EFM->FWMC, EFM_FWMC_BUSHLDCTL, u32Status);
}

/**
 * @brief  Flash single program mode(word).
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorInvalidParameter: Invalid parameter
 *           - ErrorTimeout: program error timeout
 * @note  The address should be half word align.
 */
en_result_t EFM_ProgramWord(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32tmp = 0U;
    uint32_t u32Timeout = 0U;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));

    if(u32Addr % 2U == 0U)
    {
        enRet = Ok;
        /* Clear the error flag. */
        EFM_ClearFlag(EFM_CLR_FLAG_MASK);
        /* Get chche status */
        u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Disable CACHE */
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK); 
        /* Set single program mode. */
        EFM_SetOperateMode(EFM_MODE_PROGRAMSINGLE);
        /* program data. */
        *(uint32_t*)u32Addr = (uint32_t)u32Data;

        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);

        if(u32Data != *(uint32_t*)u32Addr)
        {
            enRet = Error;
        }


        /* Recover CACHE function */
        MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);

    }

    return enRet;
}

/**
 * @brief  Flash single program mode(half word).
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u16Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorInvalidParameter: Invalid parameter
 *           - ErrorTimeout: program error timeout
 * @note  The address should be half word align.
 */
en_result_t EFM_ProgramHalfWord(uint32_t u32Addr, uint16_t u16Data)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32tmp = 0U;
    uint32_t u32Timeout = 0U;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    if(u32Addr % 2U == 0U)
    {
        enRet = Ok;
        /* Clear the error flag. */
        EFM_ClearFlag(EFM_CLR_FLAG_MASK);
        /* Get chche status */
        u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Disable CACHE */
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Set single program mode. */
        EFM_SetOperateMode(EFM_MODE_PROGRAMSINGLE);
        /* program data. */
        *(( uint16_t*)u32Addr) = u16Data;

        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
        if(u16Data != *(( uint16_t*)u32Addr))
        {
            enRet = Error;
        }

        /* Recover CACHE function */
        MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);

