levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_efm.c
        }

    return enRet;
}

/**
 * @brief  Flash single program word with read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorInvalidParameter: Invalid parameter
 *           - ErrorTimeout: program error timeout
 * @note  The address should be half word align.
 */
en_result_t EFM_ProgramWordRB(uint32_t u32Addr, uint32_t u32Data)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32tmp = 0U;
    uint32_t u32Timeout = 0U;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    if(u32Addr % 2U == 0U)
    {
        enRet = Ok;
        /* Clear the error flag. */
        EFM_ClearFlag(EFM_CLR_FLAG_MASK);
        /* Get chche status */
        u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Disable CACHE */
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Set single program mode. */
        EFM_SetOperateMode(EFM_MODE_PROGRAMREADBACK);
        /* program data. */
        *(uint32_t*)u32Addr = u32Data;

        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
        if(Set == EFM_GetFlagStatus(EFM_FLAG_PGMISMTCHERR))
        {
            /* clear flag PGMISMTCH */
            EFM_ClearFlag(EFM_CLR_FLAG_PGMISMTCHCLR);
            enRet = Error;
        }

        /* Recover CACHE function */
        MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);
    }

    return enRet;
}

/**
 * @brief  Flash single program half word with read back.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u16Data                   The specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorInvalidParameter: Invalid parameter
 *           - ErrorTimeout: program error timeout
 * @note  The address should be half word align.
 */
en_result_t EFM_ProgramHalfWordRB(uint32_t u32Addr, uint16_t u16Data)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32tmp = 0U;
    uint32_t u32Timeout = 0U;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    if(u32Addr % 2U == 0U)
    {
        enRet = Ok;
        /* Clear the error flag. */
        EFM_ClearFlag(EFM_CLR_FLAG_PEWERRCLR    | EFM_CLR_FLAG_PEPRTERRCLR | \
                      EFM_CLR_FLAG_PGMISMTCHCLR | EFM_CLR_FLAG_OPTENDCLR   | \
                      EFM_CLR_FLAG_COLERRCLR);
        /* Get chche status */
        u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Disable CACHE */
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Set single program mode. */
        EFM_SetOperateMode(EFM_MODE_PROGRAMREADBACK);
        /* program data. */
        *((uint16_t*) u32Addr) = u16Data;

        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
        {
            u32Timeout ++;
            if(u32Timeout > EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }

        if(Set == EFM_GetFlagStatus(EFM_FLAG_PGMISMTCHERR))
        {
            /* Clear flag PGMISMTCH */
            EFM_ClearFlag(EFM_CLR_FLAG_PGMISMTCHCLR);
            enRet = Error;
        }

        EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
        /* Recover CACHE function */
        MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);
    }

    return enRet;
}

/**
 * @brief  Flash sequence program.
 * @param  [in] u32Addr                   The specified program address.
 * @param  [in] u32Len                    The len of specified program data.
 * @param  [in] u8pBuf                    The pointer of specified program data.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - Error: program error
 *           - ErrorInvalidParameter: Invalid parameter
 *           - ErrorTimeout: program error timeout
 * @note  The address should be half word align.
 *        The length has to be a multiple of 2
 */
en_result_t EFM_SequenceProgram(uint32_t u32Addr, uint32_t u32Len, uint8_t *u8pBuf)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32Timeout = 0U;
    uint32_t u32tmp = 0U;
    uint32_t u32pSrc = (uint32_t )u8pBuf;
    uint32_t u32pDest = (uint32_t )u32Addr;
    uint32_t u32LoopWords = u32Len >> 2U;
    uint32_t u32RemainBytes = u32Len % 4U;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    DDL_ASSERT(IS_VALID_POINTER(u8pBuf));
    if((u32Addr % 2U == 0U) && (u32RemainBytes % 2U == 0U))
    {
        enRet = Ok;
        /* Clear the error flag. */
        EFM_ClearFlag(EFM_CLR_FLAG_MASK);
        /* Get CACHE status */
        u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Disable CACHE */
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Set sequence program mode. */
        EFM_SetOperateMode(EFM_MODE_PROGRAMSEQUENCE);

        /* program data. */
        while(u32LoopWords--)
        {
            *((uint32_t *)u32pDest) = *((uint32_t *)u32pSrc);
            u32pDest += 4U;
            u32pSrc += 4U;
            /* wait operate end. */
            while(Set != EFM_GetFlagStatus(EFM_FLAG_OPTEND))
            {
                u32Timeout++;
                if(u32Timeout >= EFM_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
            /* Clear end flag. */
            EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
        }
        if(u32RemainBytes)
        {
            *((uint16_t *)u32pDest) = *((uint16_t *)u32pSrc);
            u32pDest += 2U;
            u32pSrc += 2U;
            /* wait operate end. */
            while(Set != EFM_GetFlagStatus(EFM_FLAG_OPTEND))
            {
                u32Timeout++;
                if(u32Timeout >= EFM_TIMEOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
            /* Clear end flag. */
            EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);

