levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_efm.c
        }

        /* Set read only mode. */
        EFM_SetOperateMode(EFM_MODE_READONLY);

        u32Timeout = 0U;
        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
        {
            u32Timeout ++;
            if(u32Timeout > EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* Clear the end of operate flag */
        EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
        /* Recover CACHE */
        MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);
    }
    return enRet;
}

/**
 * @brief  Flash sector erase.
 * @param  [in] u32Addr                   The uncertain(random) address in the specified sector.
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_SectorErase(uint32_t u32Addr)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32Timeout = 0U;
    uint32_t u32tmp = 0U;

    DDL_ASSERT(IS_VALID_EFM_ADDR(u32Addr));
    if (u32Addr % 2U == 0U)
    {
        enRet = Ok;
        /* Clear the error flag. */
        EFM_ClearFlag(EFM_CLR_FLAG_MASK);
        /* Get CACHE status */
        u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Disable CACHE */
        CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
        /* Set sector erase mode. */
        EFM_SetOperateMode(EFM_MODE_ERASESECTOR);

        *(uint32_t*)u32Addr = (uint32_t)0x0UL;

        while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
        {
            u32Timeout ++;
            if(u32Timeout >= EFM_TIMEOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
        /* Clear the end of operate flag */
        EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
        /* Recover CACHE */
        MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);
    }
    return enRet;
}

/**
 * @brief  Flash chip erase.
 * @param  None
 * @retval An en_result_t enumeration value:
 *           - Ok: program success
 *           - ErrorTimeout: program error timeout
 */
en_result_t EFM_ChipErase(void)
{
    en_result_t enRet = Ok;
    uint32_t u32tmp = 0U;
    uint32_t u32Timeout = 0U;

    /* Clear the error flag. */
    EFM_ClearFlag(EFM_CLR_FLAG_MASK);
    /* Get CACHE status */
    u32tmp = READ_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
    /* Disable CACHE */
    CLEAR_REG32_BIT(M4_EFM->FRMC, EFM_CHCHE_MASK);
    /* Set sector erase mode. */
    EFM_SetOperateMode(EFM_MODE_ERASECHIP);

    *(uint32_t*)0x0UL = (uint32_t)0UL;

    while(Set != EFM_GetFlagStatus(EFM_FLAG_RDY))
    {
        u32Timeout ++;
        if(u32Timeout >= EFM_TIMEOUT)
        {
            enRet = ErrorTimeout;
            break;
        }
    }
    /* Clear the end of operate flag */
    EFM_ClearFlag(EFM_CLR_FLAG_OPTENDCLR);
    /* Recover CACHE */
    MODIFY_REG32(M4_EFM->FRMC, EFM_CHCHE_MASK, u32tmp);

    return enRet;
}

/**
 * @brief  Read unique ID.
 * @param  None
 * @retval An stc_efm_unique_id_t structure value:
 *           - uniqueID0: unique ID 0
 *           - uniqueID1: unique ID 1
 *           - uniqueID2: unique ID 2
 */
stc_efm_unique_id_t EFM_ReadUID(void)
{
    stc_efm_unique_id_t stcUID;

    stcUID.u32UniqueID0 = M4_EFM->UQID0;
    stcUID.u32UniqueID1 = M4_EFM->UQID1;
    stcUID.u32UniqueID2 = M4_EFM->UQID2;
    stcUID.u32UniqueID3 = M4_EFM->UQID3;
    return stcUID;
}

/**
 * @}
 */

#endif  /* DDL_EFM_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
